module.exports = {
    deleteRoles: ["1166193496533778503"], //الرتب اللي بتنحذ بالتغعيل
    addRoles: ["1166193495527137340"], // الرتب اللي بتنضاف بالتفعيل
    role: "1168136920153464872", //الرول اللي يمديه يفعل
    logChannel: "1166195390463344712", //روم لوق التفعيل
    ticketSender: "1166193309920808992", //اللي يمديه يرسل رسالة التكت
    supportId: "1168136920153464872", //ايدي رتبة السبورت اللي تشوف التكتات
    catg: "1166195076733620264", // كاتجوري التكتات
    blackListRoleId: "1166193497431355462", //ايدي رول بلاك ليست
    blackListAdmin: "1166193339914272882", //ايدي رتبة مسؤولين البلاك ليست
    blackListlogChannel: "1166195084727947359", // ايدي روم لوق البلاك ليست
    fgRoleID : "1168136920153464872", //ايدي رتبة الفحص والقيم 
    mo5Role : "1166193430200864840", //ايدي رتبة العسكري
    adsRole : "1152341397802860654", //ايدي رتبة الاعلانات
    catgs1 : "1146796697666715728", //كاتجوري الاعلانات
    ownersRole : "1166193339914272882", //رتبة تكت اونرات
    catgs2 : "1166195046874370159", //كاتجوري تكت اونرات
    helpRole : "1168136920153464872", //رتبة تكت طلب مساعدة
    catgs3 : "1166195079262765088", //كاتجوري تكت طلب مساعدة
    roel4: "1145823625111425064", //رول الشكاوي
    catgs4: "1145407438850379816", //كاتجوري الشكاوي
    guildId : "1158371861709733928", //ايدي السيرفر
    roatebId : "1166195039182004235", //روم لوق الرواتب
    ch: "1166193339914272882", //ايدي اللي يستخدم شيك
}