// @ts-nocheck
const BaseCommand = require('../../utils/structures/BaseCommand');
const Discord = require("discord.js")
const s = require("../../config")
module.exports = class SendTicketCommand extends BaseCommand {
  constructor() {
    super('rols2', 'ticket', []);
  }
  /**
   * 
   * @param {Discord.Client} client 
   * @param {Discord.Message} message 
   * @param {String[]} args 
   */
  async run(client, message, args) {
    if (!message.member.roles.cache.has(s.ticketSender)) return
    message.channel.send({
      embeds: [
    {
      "title":  "أنظمة الدسكورد",
      "description": "__1 - يجب على كل عضو أو اي اداري الاحترام المتبادل دون استثناء\n\n 2 -  يمنع منعاً باتاً اهانة أي اداري أو اي عضو سواء من قبل المسؤولين أو غيرهم\n\n 3 -  يمنع منعاً باتاً التكبر سواء بالرتب الوظيفية أو بالرتب الادارية أو بالمميزات الممنوحة\n\n 4 -  يمنع منعاً باتاً مجارة الشخص أو بمفهوم اخر ( التسليك ) سواء في اعطاء رتب التفعيل أو في شراء العضويات الخاصة في السيرفر أو في التوظيف سواء كأدارة أو كوظيفة عادية\n\n 5 -  يمنع منعاً باتاً التقليل من شخص بأي شكل من الاشكال سواء بشكل مباشر أو بشكل غير مباشر\n\n 6 -  يمنع منعاً باتاً العنصرية اللفظية أو الشكلية على أي شخص سواء بشكل مباشر أو بشكل غير مباشر\n\n 7 - يمنع منعاً باتاً نشر الروابط سواء بشكل مباشر أو بالتلميح\n\n 8 - يمنع منعاً باتاً نشر صور لسيرفر معين سواء بشكل مباشر أو بالتلميح\n\n 9 - يمنع منعاً باتاً ذكر اسماء السيرفرات سواء بشكل مباشر أو بالتلميح أو بالتشفير\n\n 10 - يمنع منعاً باتاً استغلال النفوذ والنشر في الشاتات أو في الخاص\n\n 11 - يمنع منعاً باتاً تنزيل مقاطع أو صور تخص سيرفرات اخرى\n\n 12 - يمنع منعاً باتاً ذكر قصص لسيرفرات اخرى\n\nملاحظة : مخالفتك لأحد القوانين يؤدي ألى مخالفتك \n\n For @everyone__",
      "color": 15434501
    }
  ]
    })
  }
}